src/main/java/ok/dht/test/yasevich/profiling/stage6/wrk/v2/range1000-rate2000
Running 30s test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 4.928ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.833ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.794ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.665ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.802ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.706ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 4.667ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 4.642ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.06ms   13.02ms 122.75ms   90.90%
    Req/Sec   145.84     86.18     0.95k    75.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.70ms
 75.000%    6.63ms
 90.000%   17.55ms
 99.000%   65.09ms
 99.900%   95.87ms
 99.990%  120.45ms
 99.999%  122.81ms
100.000%  122.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.332     0.000000            1         1.00
       0.846     0.100000         2284         1.11
       1.031     0.200000         4545         1.25
       1.166     0.300000         6813         1.43
       1.378     0.400000         9094         1.67
       1.695     0.500000        11354         2.00
       2.165     0.550000        12488         2.22
       3.217     0.600000        13622         2.50
       4.135     0.650000        14757         2.86
       5.255     0.700000        15894         3.33
       6.635     0.750000        17027         4.00
       7.343     0.775000        17595         4.44
       8.223     0.800000        18162         5.00
       9.223     0.825000        18731         5.71
      10.663     0.850000        19297         6.67
      12.999     0.875000        19867         8.00
      14.831     0.887500        20149         8.89
      17.551     0.900000        20433        10.00
      21.071     0.912500        20716        11.43
      25.743     0.925000        21000        13.33
      30.511     0.937500        21284        16.00
      33.695     0.943750        21426        17.78
      36.959     0.950000        21567        20.00
      40.351     0.956250        21710        22.86
      43.455     0.962500        21851        26.67
      47.391     0.968750        21994        32.00
      49.439     0.971875        22065        35.56
      51.775     0.975000        22135        40.00
      54.495     0.978125        22207        45.71
      57.151     0.981250        22278        53.33
      59.583     0.984375        22349        64.00
      60.607     0.985938        22383        71.11
      62.079     0.987500        22419        80.00
      63.615     0.989062        22454        91.43
      66.047     0.990625        22490       106.67
      67.903     0.992188        22525       128.00
      69.375     0.992969        22544       142.22
      71.167     0.993750        22561       160.00
      72.895     0.994531        22578       182.86
      75.199     0.995313        22596       213.33
      77.567     0.996094        22614       256.00
      78.911     0.996484        22623       284.44
      81.023     0.996875        22632       320.00
      83.391     0.997266        22640       365.71
      85.055     0.997656        22649       426.67
      87.551     0.998047        22658       512.00
      88.703     0.998242        22663       568.89
      89.727     0.998437        22667       640.00
      91.327     0.998633        22671       731.43
      95.359     0.998828        22676       853.33
      98.751     0.999023        22680      1024.00
     103.359     0.999121        22683      1137.78
     104.383     0.999219        22685      1280.00
     104.575     0.999316        22687      1462.86
     105.727     0.999414        22689      1706.67
     106.495     0.999512        22691      2048.00
     107.391     0.999561        22693      2275.56
     109.887     0.999609        22694      2560.00
     111.935     0.999658        22695      2925.71
     115.775     0.999707        22696      3413.33
     117.823     0.999756        22697      4096.00
     118.399     0.999780        22698      4551.11
     118.399     0.999805        22698      5120.00
     118.591     0.999829        22699      5851.43
     118.591     0.999854        22699      6826.67
     120.447     0.999878        22700      8192.00
     120.447     0.999890        22700      9102.22
     120.447     0.999902        22700     10240.00
     122.751     0.999915        22701     11702.86
     122.751     0.999927        22701     13653.33
     122.751     0.999939        22701     16384.00
     122.751     0.999945        22701     18204.44
     122.751     0.999951        22701     20480.00
     122.815     0.999957        22702     23405.71
     122.815     1.000000        22702          inf
#[Mean    =        7.057, StdDeviation   =       13.020]
#[Max     =      122.752, Total count    =        22702]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  38767 requests in 30.01s, 1.26GB read
  Socket errors: connect 0, read 0, write 0, timeout 296
Requests/sec:   1292.00
Transfer/sec:     43.10MB